Catalogs/Задача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Задача</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЗадачи</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостановщикЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроектГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокЗадачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоШаблон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьЗадачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетныйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контакты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗатраченоЧасовФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗатраченоЧасовПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подзадачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подзадача</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/Комментарии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>Комментарии</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстКомментария</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеПоказывать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектКомментирования</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяКоммента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Задача/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ПостановщикЗадачи = ПараметрыСеанса.ТекущийПользователь;	
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;	
		Объект.Состояние = Справочники.СостоянияЗадач.Создана;
		Если ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПроект) Тогда
			Объект.ПроектГруппа = ПараметрыСеанса.ТекущийПроект;	
		КонецЕсли;
		Объект.ДатаСоздания = ТекущаяДата();
		Комментарии.Параметры.УстановитьЗначениеПараметра("ЭтаЗадача", Справочники.Задача.ПустаяСсылка());
	Иначе
		Комментарии.Параметры.УстановитьЗначениеПараметра("ЭтаЗадача", Объект.Ссылка);
	КонецЕсли; 

	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

Процедура ОбновитьВидимостьЭлементов()
	
	Если Объект.Состояние = Справочники.СостоянияЗадач.Создана и ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.Создать.Доступность = Ложь;
		Элементы.ВРаботу.Доступность = Ложь;
		Элементы.НаПроверку.Доступность = Ложь;
		Элементы.Завершить.Доступность = Ложь;
		Элементы.Запланировать.ЦветФона = ЦветаСтиля.Зеленый;
	ИначеЕсли Объект.Состояние = Справочники.СостоянияЗадач.НаПланировании Тогда
		Элементы.Создать.Доступность = Ложь;
		Элементы.Запланировать.Доступность = Ложь;
		Элементы.НаПроверку.Доступность = Ложь;
		Элементы.Завершить.Доступность = Ложь;
		Элементы.ВРаботу.ЦветФона = ЦветаСтиля.Зеленый;
	ИначеЕсли Объект.Состояние = Справочники.СостоянияЗадач.Выполняется Тогда
		Элементы.Создать.Доступность = Ложь;
		Элементы.Запланировать.Доступность = Ложь;
		Элементы.ВРаботу.Доступность = Ложь;
		Элементы.Завершить.Доступность = Ложь;
		Элементы.НаПроверку.ЦветФона = ЦветаСтиля.Зеленый;
	ИначеЕсли Объект.Состояние = Справочники.СостоянияЗадач.НаКонтроле Тогда
		Элементы.Создать.Доступность = Ложь;
		Элементы.Запланировать.Доступность = Ложь;
		Элементы.ВРаботу.Доступность = Ложь;
		Элементы.НаПроверку.Доступность = Ложь;
		Элементы.Завершить.ЦветФона = ЦветаСтиля.Зеленый;
	ИначеЕсли Объект.Состояние = Справочники.СостоянияЗадач.Завершена Тогда
		Элементы.Создать.Доступность = Ложь;
		Элементы.Запланировать.Доступность = Ложь;
		Элементы.ВРаботу.Доступность = Ложь;
		Элементы.НаПроверку.Доступность = Ложь;
		Элементы.Завершить.Доступность = Ложь;
	Иначе //еще не записана
		Элементы.Запланировать.Доступность = Ложь;
		Элементы.ВРаботу.Доступность = Ложь;
		Элементы.НаПроверку.Доступность = Ложь;
		Элементы.Завершить.Доступность = Ложь;
		Элементы.Создать.ЦветФона = ЦветаСтиля.Зеленый;
	КонецЕсли; 
	
КонецПроцедуры
 

&НаСервере
Процедура РедактироватьНаСервере()
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		ЭтаФорма.ТолькоПросмотр = Ложь
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)
	РедактироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	врОписаниеИзХранилища = ТекущийОбъект.ОписаниеЗадачи.Получить();
	Если ТипЗнч(врОписаниеИзХранилища) = Тип("Строка") Тогда
		ВрОписание.Добавить(врОписаниеИзХранилища);
	Иначе
		ВрОписание = врОписаниеИзХранилища;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ОписаниеЗадачи = Новый ХранилищеЗначения(ВрОписание);
	ТекущийОбъект.ДатаИзменения = ТекущаяДата();
	Если Объект.Состояние = Справочники.СостоянияЗадач.Завершена Тогда
		Объект.ДатаЗавершенияФакт = ТекущаяДата();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетныйПериодПриИзменении(Элемент)
	
	//для ежемесячных задач
	//Объект.ОтчетныйПериод = КонецМесяца(Объект.ОтчетныйПериод);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКомментНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если СокрЛП(врКоммент) <> "" Тогда
			Коммент = РегистрыСведений.Комментарии.СоздатьМенеджерЗаписи();
			Коммент.ОбъектКомментирования = Объект.Ссылка;
			Коммент.Автор = ПараметрыСеанса.ТекущийПользователь;
			Коммент.ВремяКоммента = ТекущаяДата();
			Коммент.ТекстКомментария = врКоммент;
			Коммент.Записать(Истина);
			врКоммент = "";
		КонецЕсли; 
	Иначе
		Сообщить("Необходимо записать документ перед комментированием!");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКоммент(Команда)
	ДобавитьКомментНаСервере();
	Элементы.Комментарии.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадачу(Команда)
	Записать(); //статус "создана" уже есть
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура Запланировать(Команда)
	ОбщийМодульЗадачи.ИзменениеСтатусаЗадачи(Объект.Ссылка, "ОжиданиеВыполнения");
	ОбновитьВидимостьЭлементов();
	//ОбновитьОтображениеДанных(Элементы.Состояние);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ВРаботу(Команда)
	ОбщийМодульЗадачи.ИзменениеСтатусаЗадачи(Объект.Ссылка, "Выполняется");
	ОбновитьВидимостьЭлементов();
	//ОбновитьОтображениеДанных(Элементы.Состояние);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура НаПроверку(Команда)
	ОбщийМодульЗадачи.ИзменениеСтатусаЗадачи(Объект.Ссылка, "НаПроверку");
	ОбновитьВидимостьЭлементов();
	//ОбновитьОтображениеДанных(Элементы.Состояние);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Завершить(Команда)
	ОбщийМодульЗадачи.ИзменениеСтатусаЗадачи(Объект.Ссылка, "Завершена");
	ОбновитьВидимостьЭлементов();
	//ОбновитьОтображениеДанных(Элементы.Состояние);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзм(Команда)
	Записать();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Комментарии.Параметры.УстановитьЗначениеПараметра("ЭтаЗадача", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ОбновитьГлавноеОкно");
КонецПроцедуры
